[{
    "heading": "loyalsheep's story behind Natives",
    "dated" : "10 March 2018 | Shivansh Agrawal",
    "content": ["All right! This is my first blog post on loyalsheep.com and I’m writing it not for you guys, I mean, of course you can read it but this post is intended for…me! Ain’t that weird? It has been over a year since I released my first game, Natives, on Google Play and I always had the urge since then to share my experience, why I made it in the first place.",
               "The story might not be the most interesting one, but it’s something rather very important, important for me. It helped me to take a dive in the world of game creation. It begins with an idea, then we work out to materialize it for us and for the people. The idea to develop a hacking based, sci-fi game occurred to me in the fall of 2015. I released the game in February, 2017. That means it took me around one and a half year for Natives!",
               "I had a team of 3, in the beginning. In the summer of 2016, I ‘fired myself out from my own team’ due to the lack of cooperation, coordination and vision. No hard feeling guys, if you are also reading this. I was left with very little, with just the story in a PDF file, and a concept in my mind. So basically, the actual game development process started taking off from the end of July.",
               "I used Unity, because it is awesome! Unity is great. The real problem I faced while developing Natives was to generate data. If you have played the game, you know that the game makes a heavy use of data! Chats, passwords, pictures for the main targets and for the rest of the people are all handwritten and handpicked. You want a number? It’s over 1000 independent text files for chats, another 1000 files for passwords and over 500 images. That makes Natives possible, and distinct. Not going to lie, it was time consuming and frustrating!  When you have to write so many imaginary chats, which all must be different and completely unrelated from each other, you run out of ideas.",
               "One more thing that drained the development time was the editing of panoramas! Every single panorama had faults. I used Adobe Photoshop to rectify the mistakes. The rest of the time was spent on Unity, and it also, was not really a smooth ride. There were a lot of things required for Natives that I just didn’t know how to implement in Unity. Unity has awesome support, and that helped me a lot.",
               "I procrastinated many times, gave up the whole idea for developing a game. There are times when you are onto something for so long, that its meaning starts fading out. You want something new. The trick in these situations is to think why you started the process in the first place(?). When you give yourself a good reason for that, you get a boost. I wanted to create a game because I am inspired by games since when I was 4. I wanted to join the party of game development and make something different.",
               "P.S.: The title of the game, Natives, was suggested by a friend who was in my team. Before that, I used to call the game by its codename, project_VIRTUAL."]
}
]
